////////////////////////////////////////////////////////////////
//              0  1  2  3  4  5  6  7
//              →
//        0  ↓ o  o  o  o  o  o  o  o
//        1     o  o  o  o  o  o  o  o
//        2     o  o  o  o  o  o  o  o
//        3     o  o  o  o  o  o  o  o
//        4     o  o  o  o  o  o  o  o
//        5     o  o  o  o  o  o  o  o
//        6     o  o  o  o  o  o  o  o
//        7     o  o  o  o  o  o  o  o              接線朝上
//
//        顏色選擇  綠色:1 , 紅色:2 , 雙色:3
//        亮度選擇  0 ~ 7 (數字越大表示越亮)
//
////////////////////////////////////////////////////////////////
#include<FlagMatrix.h>

MLED mled(7);  //設定亮度 0~7

byte chinese[2][8]={{B00100010,B01110111,B10101010,B00000000,B11101110,B01010110,B01001010,B11110101},     //筑
                  {B00010000,B01111100,B01010100,B01111100,B00010000,B01010100,B10101010,B00111100}     //忠
                 };  

void setup() {
mled.begin();              //8*8矩陣初始化
mled.clear();              //清空8*8矩陣
}

void loop() {                      //                           ↓
  for(int j=0;j<=1;j++){            //chinese陣列中的位置   chinese[2][8]
    for(int i=0;i<=7;i++){          //第0列~第7列
      mled.setRow(j+1,i,chinese[j][i]);      //顯示一列 (顏色,列數,資料)   每一列都從我們所定義的矩陣中取資料
    }
    delay(1000);                  //暫停1秒
    mled.clear();                 //清空矩陣
  }
}
