//----------------------------------此七段顯示器為共陽極，1代表不亮，0代表亮----------------------(函式庫已更改，1代表亮，0代表不亮)
//
//  sevenSegWrite(數字)   為預設的數字顯示方式   EX.  Mysev.sevenSegWrite(20)  七段顯示器顯示20
//
//  custom(資料,資料)   可自行輸入想顯示的圖示，資料格式可為 二進位、八進位、十進位、十六進位 
//
//  EX. B10101010  8個數字的順序為 上、右上、右下、下、左下、左上、中、點
//
//---------------------------------------------------------------------------------------------------      
#include <Flag74HC595.h>   //共陽極七段顯示器函式庫

Flag74HC595 Mysev(D3,D2,D1);    //建立7段顯示器物件  參數為dataPin,clockPin,loadPin

void setup() {
Mysev.begin();            //七段顯示器初始化
}

void loop() {
  Mysev.custom(B11000110,B11000110);   //張開眼睛
  delay(1000);
  Mysev.custom(B00000010,B00000010);   //閉眼
  delay(200);
  Mysev.custom(B11000110,B11000110);   //張開眼睛
  delay(200);
  Mysev.custom(B00000010,B00000010);   //閉眼
  delay(200);
}
